# TinyRepl

Allows you to evaluate mathematical expressions with variables support

## Installation

Clone the repo and run mix build inside the directory

### Examples

```
tiny_repl(1)> a = 10
10.0
tiny_repl(2)> b = 3 + a
13.0
tiny_repl(3)> a + b * 2 - 20 / a * (5 + 27)
-28.0
tiny_repl(4)> c + 1
variable c is not defined
```
